/****设置客户端连接使用的编码****/
SET NAMES UTF8;
/****丢弃数据库ly，如果存在****/
DROP DATABASE IF EXISTS ly;
/****创建数据库，存储的编码****/
CREATE DATABASE ly CHARSET=UTF8;
/****进入该数据库****/
USE ly;
/****创建用户数据表****/
CREATE TABLE ly_user(
  uid      INT PRIMARY KEY AUTO_INCREMENT,   
  uname    VARCHAR(28) UNIQUE,    #用户名
  upwd     VARCHAR(64),    #密码
  uemail   VARCHAR(36) UNIQUE,    #邮箱
  uphone   VARCHAR(16) UNIQUE,   #手机号
  ly_name  VARCHAR(16),     #用户真实姓名
  picture  VARCHAR(128),   #头像图片
  ctime  DATETIME,
  gender   BOOL     #性别  0-女   1-男
);
INSERT INTO ly_user VALUES
(NULL,"taobao",PASSWORD("123456"),"taobao@qq.com","15012312589","淘宝","img/ee.jpg",now(),"1"),
(NULL,"jingdong",PASSWORD("123456"),"jingdong@qq.com","15012312580","京东","img/ee.jpg",now(),"1"),
(NULL,"didi",PASSWORD("123456"),"didi@qq.com","15012312581","滴滴","img/ee.jpg",now(),"0");
/****创建用户登录表****/
CREATE TABLE ly_login(
  id     INT PRIMARY KEY AUTO_INCREMENT,
  uname  VARCHAR(28),      #用户名
  upwd   VARCHAR(64)      #密码
);
INSERT INTO ly_login VALUES
(NULL,"taobao",PASSWORD("123456")),
(NULL,"jingdong",PASSWORD("123456")),
(NULL,"didi",PASSWORD("123456"));
/****轮播图表****/
CREATE TABLE ly_index_carousel(
  cid      INT PRIMARY KEY AUTO_INCREMENT,
  img_url  VARCHAR(128),          #图片路径
  href     VARCHAR(128),          #跳转路径
  title    VARCHAR(64),           #标题
  condition1  TINYINT
);
INSERT INTO ly_index_carousel VALUES
(NULL,"img/lunbo101.jpg","lll.html","轮播广告商品1",0),
(NULL,"img/lunbo102.jpg","lll.html","轮播广告商品2",0),
(NULL,"img/lunbo103.jpg","lll.html","轮播广告商品3",0),
(NULL,"img/lunbo104.jpg","lll.html","轮播广告商品4",0),
(NULL,"img/jdbg101.jpg","lll.html","轮播广告商品1",1),
(NULL,"img/jdbg102.jpg","lll.html","轮播广告商品2",1),
(NULL,"img/jdbg103.jpg","lll.html","轮播广告商品3",1),
(NULL,"img/jdbg104.jpg","lll.html","轮播广告商品4",1),
(NULL,"img/lunbo104.jpg","lll.html","轮播广告商品1",2),
(NULL,"img/lunbo105.jpg","lll.html","轮播广告商品2",2),
(NULL,"img/lunbo106.jpg","lll.html","轮播广告商品3",2),
(NULL,"img/lunbo107.jpg","lll.html","轮播广告商品4",2);
/****首页商品表****/ 
CREATE TABLE ly_index_product(
  pid     INT PRIMARY KEY AUTO_INCREMENT,
  details  VARCHAR(128),     #商品详情
  img_url  VARCHAR(128),     #图片路径
  price    DECIMAL(10,2),    #商品价格
  href     VARCHAR(128)      #详情链接
);
INSERT INTO ly_index_product VALUES
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10001.jpg",280,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10002.jpg",1880,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10003.jpg",980,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10004.jpg",1180,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10005.jpg",1860,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10006.jpg",888,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10007.jpg",360,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10008.jpg",500,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10009.jpg",380,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10010.jpg",780,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10011.jpg",2988,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10012.jpg",718,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10013.jpg",860,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10014.jpg",568,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10015.jpg",1180,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10016.jpg",1380,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10017.jpg",860,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10018.jpg",1999,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10019.jpg",769,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10020.jpg",789,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞2日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10021.jpg",659,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10022.jpg",280,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10023.jpg",1880,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10024.jpg",980,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10025.jpg",1180,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10026.jpg",1860,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10027.jpg",888,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10028.jpg",360,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10029.jpg",500,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10030.jpg",380,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10031.jpg",780,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10032.jpg",2988,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10033.jpg",718,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10034.jpg",860,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10035.jpg",568,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10036.jpg",1180,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10037.jpg",1380,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10038.jpg",860,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞3日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10039.jpg",1999,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10040.jpg",769,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机","img/dsn10041.jpg",789,"aaa.html"),
(NULL,"&lt;上海-迪士尼乐园半自助双飞2日游&gt;含1日入园门票，指定入住维纳斯国际酒店，2晚不挪窝，含双早，含酒店至乐园间往返接送车，可升级接送机","img/dsn10042.jpg",659,"aaa.html");
/****城市表****/
CREATE TABLE ly_city(
  fid      INT PRIMARY KEY AUTO_INCREMENT,
  fname    VARCHAR(16)     #城市名
);
INSERT INTO ly_city VALUES
(NULL,"北京"),
(NULL,"上海"),
(NULL,"深圳"),
(NULL,"河南省"),
(NULL,"河北省"),
(NULL,"湖南省"),
(NULL,"湖北省"),
(NULL,"安徽省"),
(NULL,"黑龙江"),
(NULL,"浙江省"),
(NULL,"四川省"),
(NULL,"江苏省"),
(NULL,"山东省"),
(NULL,"山西省"),
(NULL,"陕西省"),
(NULL,"厦门");
/****商品表****/
CREATE TABLE ly_products(
  lid   INT PRIMARY  KEY AUTO_INCREMENT,
  family_id   INT COMMENT "所属城市id",
  img_url    VARCHAR(128) COMMENT "图片",
  title  VARCHAR(256) COMMENT "标题",
  subtitle    VARCHAR(128) COMMENT "副标题",
  price       DECIMAL(10,2) COMMENT "价格",
  type1     VARCHAR(64) COMMENT "服务承诺",
  href     VARCHAR(128) COMMENT "详情链接",
  FOREIGN KEY(family_id) REFERENCES ly_city(fid)
);
INSERT INTO ly_products VALUES
(NULL, 1, 'img/dsn10001.jpg', '&lt;北京-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1000.00, '主题公园 | 方特', '111.html'),
(NULL, 1, 'img/dsn10002.jpg', '&lt;北京-欢乐谷自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，欢乐谷赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 900.00, '主题公园 | 欢乐谷', '111.html'),
(NULL, 1, 'img/dsn10003.jpg', '&lt;北京-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 800.00, '主题公园 | 方特', '111.html'),
(NULL, 1, 'img/dsn10004.jpg', '&lt;北京-欢乐谷半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，欢乐谷赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080.00, '主题公园 | 欢乐谷', '111.html'),
(NULL, 2, 'img/dsn10005.jpg', '&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，迪士尼赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园 绑定上海迪士尼度假区APP领取快速', 2800, '主题公园 | 迪士尼', '111.html'),
(NULL, 2, 'img/dsn10006.jpg', '&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，迪士尼赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园 绑定上海迪士尼度假区APP领取快速', 2680, '主题公园 | 迪士尼', '111.html'),
(NULL, 2, 'img/dsn10007.jpg', '&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，迪士尼赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园 绑定上海迪士尼度假区APP领取快速', 3800, '主题公园 | 迪士尼', '111.html'),
(NULL, 2, 'img/dsn10008.jpg', '&lt;上海-迪士尼乐园半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，迪士尼赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园 绑定上海迪士尼度假区APP领取快速', 1800, '主题公园 | 迪士尼', '111.html'),
(NULL, 3, 'img/dsn10009.jpg', '&lt;深圳-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 3, 'img/dsn10010.jpg', '&lt;深圳-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 3, 'img/dsn10011.jpg', '&lt;深圳-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 3, 'img/dsn10012.jpg', '&lt;深圳-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', '880.00', '主题公园 | 方特', '111.html'),
(NULL, 4, 'img/dsn10013.jpg', '&lt;郑州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 4, 'img/dsn10014.jpg', '&lt;郑州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 4, 'img/dsn10015.jpg', '&lt;郑州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL,4, 'img/dsn10016.jpg', '&lt;郑州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 5, 'img/dsn10017.jpg', '&lt;石家庄-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 5, 'img/dsn10018.jpg', '&lt;石家庄-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 5, 'img/dsn10019.jpg', '&lt;石家庄-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 5, 'img/dsn10020.jpg', '&lt;石家庄-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 6, 'img/dsn10021.jpg', '&lt;长沙-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 6, 'img/dsn10022.jpg', '&lt;长沙-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 6, 'img/dsn10023.jpg', '&lt;长沙-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 6, 'img/dsn10024.jpg', '&lt;长沙-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 7, 'img/dsn10025.jpg', '&lt;武汉-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 7, 'img/dsn10026.jpg', '&lt;武汉-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 7, 'img/dsn10027.jpg', '&lt;武汉-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 7, 'img/dsn10028.jpg', '&lt;武汉-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 8, 'img/dsn10029.jpg', '&lt;合肥-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 8, 'img/dsn10030.jpg', '&lt;合肥-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 8, 'img/dsn10031.jpg', '&lt;合肥-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 8, 'img/dsn10032.jpg', '&lt;合肥-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 9, 'img/dsn10033.jpg', '&lt;长春-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 9, 'img/dsn10034.jpg', '&lt;长春-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 9, 'img/dsn10035.jpg', '&lt;长春-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 9, 'img/dsn10036.jpg', '&lt;长春-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 10, 'img/dsn10037.jpg', '&lt;杭州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 10, 'img/dsn10038.jpg', '&lt;杭州-欢乐谷半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，欢乐谷赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 欢乐谷', '111.html'),
(NULL, 10, 'img/dsn10039.jpg', '&lt;杭州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 10, 'img/dsn10040.jpg', '&lt;杭州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 11, 'img/dsn10041.jpg', '&lt;成都-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 11, 'img/dsn10042.jpg', '&lt;成都-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 11, 'img/dsn10043.jpg', '&lt;成都-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 11, 'img/dsn10044.jpg', '&lt;成都-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 12, 'img/dsn10045.jpg', '&lt;苏州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 12, 'img/dsn10046.jpg', '&lt;苏州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 12, 'img/dsn10047.jpg', '&lt;苏州-欢乐谷自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，欢乐谷赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 欢乐谷', '111.html'),
(NULL, 12, 'img/dsn10048.jpg', '&lt;苏州-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 13, 'img/dsn10010.jpg', '&lt;济南-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 13, 'img/dsn10011.jpg', '&lt;济南-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 13, 'img/dsn10012.jpg', '&lt;济南-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 13, 'img/dsn10013.jpg', '&lt;济南-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 14, 'img/dsn10014.jpg', '&lt;太原-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 14, 'img/dsn10015.jpg', '&lt;太原-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 14, 'img/dsn10016.jpg', '&lt;太原-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 14, 'img/dsn10017.jpg', '&lt;太原-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 15, 'img/dsn10018.jpg', '&lt;西安-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 15, 'img/dsn10019.jpg', '&lt;西安-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 方特', '111.html'),
(NULL, 15, 'img/dsn10021.jpg', '&lt;西安-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 15, 'img/dsn10022.jpg', '&lt;西安-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html'),
(NULL, 16, 'img/dsn10023.jpg', '&lt;厦门-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 680, '主题公园 | 方特', '111.html'),
(NULL, 16, 'img/dsn10024.jpg', '&lt;厦门-欢乐谷自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，欢乐谷赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 180, '主题公园 | 欢乐谷', '111.html'),
(NULL, 16, 'img/dsn10025.jpg', '&lt;厦门-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 1080, '主题公园 | 方特', '111.html'),
(NULL, 16, 'img/dsn10026.jpg', '&lt;厦门-方特半自助双飞1日游&gt;含1日入园门票，可升级接送机', '一日票提前2天23点前预定送餐券，方特赠送餐券活动12月30号结束 刷证件入园，快注意填写正确的身份证与手机号码，避免影响入园', 880, '主题公园 | 方特', '111.html');
/**** 酒店表 ****/
CREATE TABLE ly_hotel(
  hid    INT PRIMARY KEY AUTO_INCREMENT,
  family_id   INT COMMENT "所属城市id",
  title   VARCHAR(128) COMMENT "酒店标题",
  subtitle   VARCHAR(256) COMMENT "副标题",
  pic    VARCHAR(128) COMMENT "图片",
  pic1   VARCHAR(128) COMMENT ".图.",
  price  DECIMAL(10,2) COMMENT "价格",
  city   VARCHAR(36) COMMENT "城市",
  recommend  TINYINT COMMENT "是否推荐",
  FOREIGN KEY(family_id) REFERENCES ly_city(fid)
);
INSERT INTO ly_hotel VALUES
(NULL,1,"北京赛特饭店","","img/jd10001.jpg","",188,"北京",0),
(NULL,1,"北京饭店","","img/jd10002.jpg","",128,"北京",0),
(NULL,1,"北京长城饭店","","img/jd10003.jpg","",588,"北京",0),
(NULL,1,"北京福地凰城酒店","","img/jd10004.jpg","",380,"北京",0),
(NULL,2,"上海威斯汀大饭店","","img/jd10005.jpg","",980,"上海",0),
(NULL,2,"上海迪士尼乐园酒店","","img/jd10006.jpg","",1850,"上海",0),
(NULL,2,"上海明捷万丽酒店","","img/jd10007.jpg","",580,"上海",0),
(NULL,2,"上海中福大酒店","","img/jd10008.jpg","",380,"上海",0),
(NULL,3,"深圳湾科技园海尚酒店","","img/jd10009.jpg","",600,"深圳",0),
(NULL,3,"深圳富临大酒店","","img/jd10010.jpg","",680,"深圳",0),
(NULL,3,"深圳太阳花酒店","","img/jd10011.jpg","",280,"深圳",0),
(NULL,3,"维也纳酒店深圳会展中心店","","img/jd10012.jpg","",1280,"深圳",0),
(NULL,16,"厦门途庄精品酒店","","img/jd10013.jpg","",380,"厦门",0),
(NULL,16,"厦门艾美酒店","","img/jd10014.jpg","",280,"厦门",0),
(NULL,16,"厦门海悦山庄酒店","","img/jd10015.jpg","",980,"厦门",0),
(NULL,16,"厦门瑞颐大酒店","","img/jd10016.jpg","",870,"厦门",0),
(NULL,10,"杭州钱江新城万怡酒店","","img/jd10017.jpg","",680,"杭州",0),
(NULL,10,"杭州米兰花园酒店(西湖店）","","img/jd10018.jpg","",380,"杭州",0),
(NULL,10,"浙江西子宾馆·汪庄","","img/jd10019.jpg","",658,"杭州",0),
(NULL,10,"杭州良渚君澜度假酒店","","img/jd10020.jpg","",860,"杭州",0),
(NULL,9,"哈尔滨威斯汀大饭店","","img/jd10053.jpg","",680,"哈尔滨",0),
(NULL,9,"维也纳酒店哈尔滨中心店","","img/jd10054.jpg","",1800,"哈尔滨",0),
(NULL,9,"哈尔滨太阳花酒店","","img/jd10055.jpg","",880,"哈尔滨",0),
(NULL,9,"哈尔滨威斯汀大饭店","","img/jd10056.jpg","",1080,"哈尔滨",0),
(NULL,1,"亲子游","让宝宝睡得舒心,玩的开心","img/jds10004.jpg","img/jds10002.jpg",1080,"北京",1),
(NULL,2,"自由行","不跟团,玩的自由,定义旅游新方式","img/jds10005.jpg","img/jds10001.jpg",1080,"上海",1),
(NULL,3,"跟团游","不错过每一处风景,带你欣赏全世界","img/jds10009.jpg","img/jds10003.jpg",1080,"深圳",1),
(NULL,1,"北京滨威斯汀大饭店","","img/jds10002.jpg","",1080,"北京",2),
(NULL,2,"上海滨威斯汀大饭店","","img/jds10004.jpg","",1080,"上海",2),
(NULL,3,"深圳威斯汀大饭店","","img/jds10005.jpg","",1080,"深圳",2),
(NULL,4,"郑州威斯汀大饭店","","img/jds10006.jpg","",1080,"郑州",2),
(NULL,5,"石家庄威斯汀大饭店","","img/jds10007.jpg","",1080,"石家庄",2),
(NULL,6,"长沙威斯汀大饭店","","img/jds10008.jpg","",1080,"长沙",2),
(NULL,9,"哈尔滨威斯汀大饭店","","img/jds10009.jpg","",1080,"哈尔滨",2),
(NULL,10,"杭州威斯汀大饭店","","img/jds10010.jpg","",1080,"杭州",2),
(NULL,16,"厦门威斯汀大饭店","","img/jds10011.jpg","",1080,"厦门",2),
(NULL,12,"苏州威斯汀大饭店","","img/jds10012.jpg","",1080,"苏州",2);
/**** 特卖表 ****/
CREATE TABLE ly_sale(
  aid     INT PRIMARY KEY AUTO_INCREMENT,
  title   VARCHAR(128) COMMENT "标题",
  subtitle   VARCHAR(256) COMMENT "副标题",
  pic     VARCHAR(128) COMMENT "图片",
  price   DECIMAL(10,2) COMMENT "价格",
  city   VARCHAR(36) COMMENT "所属城市",
  condition1  TINYINT
);
INSERT INTO ly_sale VALUES
(NULL,"全国出发<上海迪士尼春节特价>含酒店3晚不挪窝,1日入园门票，指定入住维纳斯国际酒店","","img/dsn10001.jpg",3888,"上海",0),
(NULL,"全国出发<上海迪士尼春节特价>含酒店3晚不挪窝,1日入园门票，指定入住维纳斯国际酒店","","img/dsn10002.jpg",1800,"上海",0),
(NULL,"全国出发<上海迪士尼春节特价>含酒店3晚不挪窝,1日入园门票，指定入住维纳斯国际酒店","","img/dsn10003.jpg",2560,"上海",0),
(NULL,"全国出发<上海迪士尼春节特价>含酒店3晚不挪窝,1日入园门票，指定入住维纳斯国际酒店","","img/dsn10004.jpg",1980,"上海",0),
(NULL,"郑州方特欢乐世界,年末促销中","郑州方特","img/dsn10005.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10006.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10007.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10008.jpg",1980,"广州",1),
(NULL,"华东旅游 全国飞机直达上海 南京 乌镇","郑州方特","img/dsn10009.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10010.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10011.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10012.jpg",1980,"广州",1),
(NULL,"华东旅游 全国飞机直达上海 南京 乌镇","郑州方特","img/dsn10013.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10014.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10015.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10016.jpg",1980,"广州",1),
(NULL,"华东旅游 全国飞机直达上海 南京 乌镇","郑州方特","img/dsn10017.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10018.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10019.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10020.jpg",1980,"广州",1),
(NULL,"郑州方特欢乐世界,年末促销中","郑州方特","img/dsn10021.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10022.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10023.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10024.jpg",1980,"广州",1),
(NULL,"华东旅游 全国飞机直达上海 南京 乌镇","郑州方特","img/dsn10016.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10025.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10026.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10027.jpg",1980,"广州",1),
(NULL,"华东旅游 全国飞机直达上海 南京 乌镇","郑州方特","img/dsn10026.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10028.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10029.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10030.jpg",1980,"广州",1),
(NULL,"华东旅游 全国飞机直达上海 南京 乌镇","郑州方特","img/dsn10005.jpg",3888,"郑州",1),
(NULL,"上海方特欢乐世界,年末促销中","上海方特","img/dsn10032.jpg",1800,"上海",1),
(NULL,"深圳方特欢乐世界,年末促销中","深圳方特","img/dsn10033.jpg",2560,"深圳",1),
(NULL,"广州方特欢乐世界,年末促销中","广州方特","img/dsn10034.jpg",1980,"广州",1);
